In [1]:
import pandas as pd

In [3]:
df = pd.read_csv("pd_employee_data.csv")

In [4]:
df
# Pandas automatically write NaN at missing value

    id          name   age country   gender   income
0    1      John Doe  29.0     USA     Male  55000.0
1    1      John Doe  29.0     USA     Male  55000.0
2    2    Jane Smith   NaN  Canada   Female  62000.0
3    3          Alex   NaN     USA  Unknown  47000.0
4    4  Maria Garcia  34.0   Spain   Female      NaN
5    5        Li Wei  27.0   China     Male  51000.0
6    6           NaN  45.0   India   Female  73000.0
7    7    Ahmed Khan  38.0     NaN     Male  68000.0
8    8    Rachel Lee  29.0     USA   Female  62000.0
9    9   Carlos Ruiz   NaN  Mexico     Male  45000.0
10  10   Emily Davis  31.0     USA      NaN  58000.0

In [ ]:
# Handle missing values
# code below

In [6]:
# isnull - It returns true where null value present
df.isnull()

       id   name    age  country  gender  income
0   False  False  False    False   False   False
1   False  False  False    False   False   False
2   False  False   True    False   False   False
3   False  False   True    False   False   False
4   False  False  False    False   False    True
5   False  False  False    False   False   False
6   False   True  False    False   False   False
7   False  False  False     True   False   False
8   False  False  False    False   False   False
9   False  False   True    False   False   False
10  False  False  False    False    True   False

In [7]:
# isna - It returns true where null value present
# The other nae of isnull
# The work of isnull and isna is same
df.isna()

       id   name    age  country  gender  income
0   False  False  False    False   False   False
1   False  False  False    False   False   False
2   False  False   True    False   False   False
3   False  False   True    False   False   False
4   False  False  False    False   False    True
5   False  False  False    False   False   False
6   False   True  False    False   False   False
7   False  False  False     True   False   False
8   False  False  False    False   False   False
9   False  False   True    False   False   False
10  False  False  False    False    True   False

In [11]:
# isnull().sum() - Count the missing value per column
df.isnull().sum()

id         0
name       1
age        3
country    1
gender     1
income     1
dtype: int64

In [12]:
# dropna - use to drop all the null value containing row from our data
df.dropna()

   id        name   age country  gender   income
0   1    John Doe  29.0     USA    Male  55000.0
1   1    John Doe  29.0     USA    Male  55000.0
5   5      Li Wei  27.0   China    Male  51000.0
8   8  Rachel Lee  29.0     USA  Female  62000.0

In [13]:
# dropna(asis=1) - use to drop all the null value containing column from our data
df.dropna(axis=1)

    id
0    1
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
10  10

In [15]:
# fillna(value) - fill the missing place with passing value
df.fillna("Pritam")

    id          name     age country   gender   income
0    1      John Doe    29.0     USA     Male  55000.0
1    1      John Doe    29.0     USA     Male  55000.0
2    2    Jane Smith  Pritam  Canada   Female  62000.0
3    3          Alex  Pritam     USA  Unknown  47000.0
4    4  Maria Garcia    34.0   Spain   Female   Pritam
5    5        Li Wei    27.0   China     Male  51000.0
6    6        Pritam    45.0   India   Female  73000.0
7    7    Ahmed Khan    38.0  Pritam     Male  68000.0
8    8    Rachel Lee    29.0     USA   Female  62000.0
9    9   Carlos Ruiz  Pritam  Mexico     Male  45000.0
10  10   Emily Davis    31.0     USA   Pritam  58000.0

In [16]:
# Fill the missing value of age column by average value of present value
df["age"].fillna(df["age"].mean())

0     29.00
1     29.00
2     32.75
3     32.75
4     34.00
5     27.00
6     45.00
7     38.00
8     29.00
9     32.75
10    31.00
Name: age, dtype: float64

In [22]:
# Store the clean data (age) in separate
cleaned_data = df.copy()
age_mean = cleaned_data["age"].mean()
cleaned_data["age"] = cleaned_data["age"].fillna(age_mean)
cleaned_data

    id          name    age country   gender   income
0    1      John Doe  29.00     USA     Male  55000.0
1    1      John Doe  29.00     USA     Male  55000.0
2    2    Jane Smith  32.75  Canada   Female  62000.0
3    3          Alex  32.75     USA  Unknown  47000.0
4    4  Maria Garcia  34.00   Spain   Female      NaN
5    5        Li Wei  27.00   China     Male  51000.0
6    6           NaN  45.00   India   Female  73000.0
7    7    Ahmed Khan  38.00     NaN     Male  68000.0
8    8    Rachel Lee  29.00     USA   Female  62000.0
9    9   Carlos Ruiz  32.75  Mexico     Male  45000.0
10  10   Emily Davis  31.00     USA      NaN  58000.0

In [23]:
df.ffill()

# Foreward filling value from the top

    id          name   age country   gender   income
0    1      John Doe  29.0     USA     Male  55000.0
1    1      John Doe  29.0     USA     Male  55000.0
2    2    Jane Smith  29.0  Canada   Female  62000.0
3    3          Alex  29.0     USA  Unknown  47000.0
4    4  Maria Garcia  34.0   Spain   Female  47000.0
5    5        Li Wei  27.0   China     Male  51000.0
6    6        Li Wei  45.0   India   Female  73000.0
7    7    Ahmed Khan  38.0   India     Male  68000.0
8    8    Rachel Lee  29.0     USA   Female  62000.0
9    9   Carlos Ruiz  29.0  Mexico     Male  45000.0
10  10   Emily Davis  31.0     USA     Male  58000.0

In [24]:
df.bfill()

# backward filling value from the bottom.

    id          name   age country   gender   income
0    1      John Doe  29.0     USA     Male  55000.0
1    1      John Doe  29.0     USA     Male  55000.0
2    2    Jane Smith  34.0  Canada   Female  62000.0
3    3          Alex  34.0     USA  Unknown  47000.0
4    4  Maria Garcia  34.0   Spain   Female  51000.0
5    5        Li Wei  27.0   China     Male  51000.0
6    6    Ahmed Khan  45.0   India   Female  73000.0
7    7    Ahmed Khan  38.0     USA     Male  68000.0
8    8    Rachel Lee  29.0     USA   Female  62000.0
9    9   Carlos Ruiz  31.0  Mexico     Male  45000.0
10  10   Emily Davis  31.0     USA      NaN  58000.0

In [25]:
# handle dupplicate
# Code below

In [28]:
# duplicated() - For check how many dupplicate values are in data
df.duplicated()

# Return true when found dupplicate row
# In this data 2nd row is dupplicate

# For specific value dupplicate ( column wise )
# df["country"].duplicated()

0     False
1      True
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
dtype: bool

In [43]:
# For delete dupplicate row
df2 = df.copy()
df.drop_duplicates()
# inplace = True , for store as original
# With out inplace = True, It doesn't reflect in original file

    id          name   age country   gender   income
0    1      John Doe  29.0     USA     Male  55000.0
2    2    Jane Smith   NaN  Canada   Female  62000.0
3    3          Alex   NaN     USA  Unknown  47000.0
4    4  Maria Garcia  34.0   Spain   Female      NaN
5    5        Li Wei  27.0   China     Male  51000.0
6    6           NaN  45.0   India   Female  73000.0
7    7    Ahmed Khan  38.0     NaN     Male  68000.0
8    8    Rachel Lee  29.0     USA   Female  62000.0
9    9   Carlos Ruiz   NaN  Mexico     Male  45000.0
10  10   Emily Davis  31.0     USA      NaN  58000.0

In [44]:
df

    id          name   age country   gender   income
0    1      John Doe  29.0     USA     Male  55000.0
2    2    Jane Smith   NaN  Canada   Female  62000.0
3    3          Alex   NaN     USA  Unknown  47000.0
4    4  Maria Garcia  34.0   Spain   Female      NaN
5    5        Li Wei  27.0   China     Male  51000.0
6    6           NaN  45.0   India   Female  73000.0
7    7    Ahmed Khan  38.0     NaN     Male  68000.0
8    8    Rachel Lee  29.0     USA   Female  62000.0
9    9   Carlos Ruiz   NaN  Mexico     Male  45000.0
10  10   Emily Davis  31.0     USA      NaN  58000.0

In [45]:
# handle data types
# Code below

In [47]:
df.dtypes

# Types of each column

id           int64
name        object
age        float64
country     object
gender      object
income     float64
dtype: object

In [56]:
# Change type (age : float64 to int64) by using astype()
df2 = df.copy()

df2 = df.fillna(0)
df2 = df2["age"].astype("int64").copy()
df2.dtypes

dtype('int64')

In [60]:
# to_datetime()
date = "31-Dec-2025"
type(date) # Str

# convrt it to date time
convert_dttm = pd.Series([pd.to_datetime(date)])
type(convert_dttm.dtypes)

numpy.dtypes.DateTime64DType

In [61]:
# handel Strings
# Code below

In [63]:
# .str.lower()

# Convert all value of gender into lower case
df["gender"].str.lower()

0        male
2      female
3     unknown
4      female
5        male
6      female
7        male
8      female
9        male
10        NaN
Name: gender, dtype: object

In [64]:
# .str.uppar() or .str.capitalize()

# Convert all value of gender into Uppar case
df["gender"].str.upper()

0        MALE
2      FEMALE
3     UNKNOWN
4      FEMALE
5        MALE
6      FEMALE
7        MALE
8      FEMALE
9        MALE
10        NaN
Name: gender, dtype: object

In [65]:
# .str.strip() 

# Remove extra spaces

In [67]:
# .str.split("") 
# Separate first name and last name of name column

df["name"].str.split(" ") # here space is the separater. Separater cab ne anything according to data

# if we have
# pritam@gmail.com
# pritesh@gmail.com
# We want only the name then we use separater as @

0         [John, Doe]
2       [Jane, Smith]
3              [Alex]
4     [Maria, Garcia]
5           [Li, Wei]
6                 NaN
7       [Ahmed, Khan]
8       [Rachel, Lee]
9      [Carlos, Ruiz]
10     [Emily, Davis]
Name: name, dtype: object

In [69]:
# .str.contains() 

df["country"].str.contains("USA", case = False) # return True those row of contyry column having country USA
# case = False for ignore case sensitivity

0      True
2     False
3      True
4     False
5     False
6     False
7       NaN
8      True
9     False
10     True
Name: country, dtype: object